{
  "platform": "YouTube",
  "channelId": "UC_pKSnd_emg2JJMDGJpwZnQ",
  "channelName": "The Idea Sandbox",
  "items": [
    {
      "id": "youtube-AFsZ4EVVRrw",
      "videoId": "AFsZ4EVVRrw",
      "title": "90% of Startups Fail. DeSilo Changes That.",
      "description": "Most startups don't fail from bad ideas—they fail from bad access. The data is clear: where you are and who you know determines whether you succeed more than talent or hustle.\n42% build something nobody wants. 29% never apply for funding they'd qualify for. 73% of fintech startups die from regulatory blindspots they didn't see coming.\nWe're building DeSilo to fix this—a tool that puts accelerator-level intelligence in every founder's hands.\n🗓️ Beta Focus Group is on January 21st, 2026 at 12:00 ...",
      "link": "https://www.youtube.com/watch?v=AFsZ4EVVRrw",
      "publishedAt": "2026-01-20T16:58:10+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/AFsZ4EVVRrw/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/AFsZ4EVVRrw/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 80
    },
    {
      "id": "youtube-v8V3aHh9z0Y",
      "videoId": "v8V3aHh9z0Y",
      "title": "India's Emergency Response is Broken. Here's How AI Fixes It.",
      "description": "Every year, India loses 2.4 million people to treatable conditions — heart attacks, road accidents, snakebites, maternal emergencies.\n\nThe treatments exist. The hospitals exist. The ambulances exist.\n\nWhat's missing is coordination.\n\nOnly 7% of trauma patients in India reach a hospital within the &quot;Golden Hour&quot; — that critical 60-minute window when intervention saves lives. In the US, it's over 50%.\n\nThis video proposes Golden Hour — a voice-first, AI-powered emergency response system t...",
      "link": "https://www.youtube.com/watch?v=v8V3aHh9z0Y",
      "publishedAt": "2026-01-16T23:00:00+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/v8V3aHh9z0Y/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/v8V3aHh9z0Y/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 184
    },
    {
      "id": "youtube-m5D5yiglvjE",
      "videoId": "m5D5yiglvjE",
      "title": "India’s Stray Dog Crisis: Too Poor and Too Afraid To Care?",
      "description": "India’s stray dog crisis is usually framed as “cruel owners” vs “dangerous dogs” but what if the real story is poverty, fear and caste. \nIn this Idea Sandbox clip, glaciologist and animal‑welfare researcher Dr. Julie Palais explains how millions of street dogs end up sick, starving and full of skin disease, which makes them look terrifying while rabies cases rise and people become more afraid of being bitten. That fear stops people from helping, and the lack of help keeps the dogs dangerous—a se...",
      "link": "https://www.youtube.com/watch?v=m5D5yiglvjE",
      "publishedAt": "2025-12-22T18:11:47+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/m5D5yiglvjE/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/m5D5yiglvjE/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 21
    },
    {
      "id": "youtube-o0gOSzVKxCk",
      "videoId": "o0gOSzVKxCk",
      "title": "Why Artists Hate Their Own Work (And Why That’s Okay)",
      "description": "If you make anything - paintings, photos, podcasts - you probably hate your own work the moment it’s finished, then cringe at it years later. In this Idea Sandbox clip, artist Preeti Varma explains why that’s a normal part of the creative process, describing how she constantly walks toward and away from her canvas, looking at it from different angles until she reaches a personal “point of resolution”.​​\n\nPreeti talks about revisiting paintings and photo books made after a 13‑year hiatus and real...",
      "link": "https://www.youtube.com/watch?v=o0gOSzVKxCk",
      "publishedAt": "2025-12-18T19:10:59+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/o0gOSzVKxCk/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/o0gOSzVKxCk/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 8
    },
    {
      "id": "youtube-pvagGEhMiTU",
      "videoId": "pvagGEhMiTU",
      "title": "Can Civil Society Save India’s Democracy?",
      "description": "What will really save Indian democracy - elections every five years, or ordinary people saying “enough is enough”. \nIn this Idea Sandbox clip, veteran journalist Kalpana argues that only civil society, youth movements and independent digital media can stop India sliding into division and violence between citizens. She explains how school education and rewritten history books, social media echo chambers and ghettoised neighbourhoods are making it harder for kids to grow up seeing India as one soc...",
      "link": "https://www.youtube.com/watch?v=pvagGEhMiTU",
      "publishedAt": "2025-12-17T20:46:48+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/pvagGEhMiTU/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/pvagGEhMiTU/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 7
    },
    {
      "id": "youtube-EhURmnJav3E",
      "videoId": "EhURmnJav3E",
      "title": "India’s Architecture of Chaos: Rahul Mehrotra Explains Our 4 Ways of Building",
      "description": "Since India’s economic liberalisation in 1990, our cities have become a cacophony of architectures - glass towers, regional buildings, alternative craft projects and brand new “ancient” temples all jostling on the same streets. In this Idea Sandbox clip, architect and Harvard GSD professor Rahul Mehrotra breaks down his framework from Architecture in India Since 1990, mapping four types of practice: global architecture of “impatient capital”, regionally rooted work, collaborative alternate pract...",
      "link": "https://www.youtube.com/watch?v=EhURmnJav3E",
      "publishedAt": "2025-12-16T21:09:58+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/EhURmnJav3E/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/EhURmnJav3E/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 103
    },
    {
      "id": "youtube-SRYBJsnV7cI",
      "videoId": "SRYBJsnV7cI",
      "title": "India’s Street Dog Crisis: Too Poor To Care?",
      "description": "Why do India and Nepal treat street dogs so differently from pampered pet dogs - is it cruelty, culture, caste or just poverty. In this Idea Sandbox clip, glaciologist and animal-welfare researcher Dr. Julie Palais explains that many families in India and Nepal are living on the edge, spending hours commuting and just trying to survive each day, so they simply don’t have the money, time or bandwidth to adopt and care for stray dogs.​​\n\nShe describes how wealthier, urban families with disposable ...",
      "link": "https://www.youtube.com/watch?v=SRYBJsnV7cI",
      "publishedAt": "2025-12-15T23:12:16+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/SRYBJsnV7cI/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/SRYBJsnV7cI/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 18
    },
    {
      "id": "youtube-EX02iKe0Vdg",
      "videoId": "EX02iKe0Vdg",
      "title": "I Built an AI to Read Every Indian Law (Politicians Won’t Like This)",
      "description": "As a tech/AI engineer, Rajeev built a prototype that reads every new Indian bill for you translating Hindi-English PDFs, summarising 25‑page documents, pulling past laws and distilling the real impact in minutes. He describes AI as having “a team of eight research assistants or interns” working for each citizen, giving ordinary people the power to finally understand legislation that controls their money and rights.​\n\nIn this Idea Sandbox clip, he explains how his tool translates bills, captures ...",
      "link": "https://www.youtube.com/watch?v=EX02iKe0Vdg",
      "publishedAt": "2025-12-14T23:59:43+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/EX02iKe0Vdg/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/EX02iKe0Vdg/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 37
    },
    {
      "id": "youtube-uI0bxHBwNc4",
      "videoId": "uI0bxHBwNc4",
      "title": "Bombay vs Mumbai: The Hidden Cost of Renaming Our Cities",
      "description": "India is in a frenzy of renaming cities from Bombay to Mumbai and Bangalore to Bengaluru but almost nobody talks about the hidden cost of changing a city’s name. In this Idea Sandbox clip, Harvard GSD professor and architect Rahul Mehrotra explains why cities are actually brands with decades of global recognition, cultural memory and economic value attached to their names.​\n\nHe and Rajeev dig into questions politicians rarely answer: Who are the real stakeholders in these city name changes, how ...",
      "link": "https://www.youtube.com/watch?v=uI0bxHBwNc4",
      "publishedAt": "2025-12-12T22:59:03+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/uI0bxHBwNc4/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/uI0bxHBwNc4/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 285
    },
    {
      "id": "youtube-pjzOkRg3eks",
      "videoId": "pjzOkRg3eks",
      "title": "1 Death Every 3 Minutes: India's Road Crisis Exposed",
      "description": "India tops global road fatalities with 168,000 deaths in 2022 alone - that's 465 Indians dying daily in road accidents, boiling down to ONE DEATH EVERY 3 MINUTES on our highways and streets. In this explosive Idea Sandbox clip, co-host Kishore unleashes a raw rant on why India leads the world in road deaths, slamming the transport minister and MPs for zero accountability as 10 people perish while they joke around. He breaks it down: from shocking statistics to the human cost, asking if this does...",
      "link": "https://www.youtube.com/watch?v=pjzOkRg3eks",
      "publishedAt": "2025-12-12T00:11:23+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/pjzOkRg3eks/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/pjzOkRg3eks/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 10
    },
    {
      "id": "youtube-Gi94Z0DnDlI",
      "videoId": "Gi94Z0DnDlI",
      "title": "Why Indians Don’t Want Salon Jobs (And Who’s Doing Them Instead)",
      "description": "Across Bengaluru and other Indian cities, most salon floors are run by workers from the North‑East, Nepal and Manipur while many “local” families still see barbering and beauty work as “below” their caste or status. In this Idea Sandbox clip, Giri breaks down why his own community refused to step into salons, how much stylists actually earn, and how Northeastern and Nepali workers ended up dominating the industry through sheer hard work and willingness to do hands‑on service.​\n\nHe shares stories...",
      "link": "https://www.youtube.com/watch?v=Gi94Z0DnDlI",
      "publishedAt": "2025-12-10T21:20:41+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/Gi94Z0DnDlI/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/Gi94Z0DnDlI/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 14
    },
    {
      "id": "youtube-QMLWGUMQEh4",
      "videoId": "QMLWGUMQEh4",
      "title": "Cities Are Made, Not Found: Mumbai, Bangalore and Our Passive Citizens",
      "description": "Harvard GSD professor and architect Rahul Mehrotra explains why cities like Mumbai and Bangalore are not things you “find” but places you actively make. Starting with the myth around the name “Mumbai” and his essay “Dysfunctional Boomtown” on Bangalore, he shows how governments and developers rename, rebrand and reshape cities while citizens stay “asleep at the wheel,” treating urban life like a product instead of a collective project.​\n\nIn this Idea Sandbox clip, Mehrotra argues that when we sa...",
      "link": "https://www.youtube.com/watch?v=QMLWGUMQEh4",
      "publishedAt": "2025-12-09T19:56:17+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/QMLWGUMQEh4/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/QMLWGUMQEh4/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 10
    },
    {
      "id": "youtube-nry-xSuOrE0",
      "videoId": "nry-xSuOrE0",
      "title": "Why No One Wants Kids Anymore: Stanford Sociologist Explains Japan &amp; South Korea’s Baby Crisis",
      "description": "Across Japan, South Korea and other rich countries, birth rates are falling so fast that governments are begging people to go home, have sex and make more babies. Yet nothing changes. In this Idea Sandbox clip, Stanford sociologist Dr Michael Rosenfeld explains one uncomfortable reason why: decades of strict family rules and conservative sexual norms have made marriage and kids feel so constraining that many people are simply opting out.​​​\n\nDrawing on demographic research, he breaks down how de...",
      "link": "https://www.youtube.com/watch?v=nry-xSuOrE0",
      "publishedAt": "2025-12-08T20:57:24+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/nry-xSuOrE0/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/nry-xSuOrE0/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 806
    },
    {
      "id": "youtube-FVYRVLXTlGc",
      "videoId": "FVYRVLXTlGc",
      "title": "This Is What America Looks Like to Someone Who Wasn’t Born Here",
      "description": "Master Sergeant Stephen Graves from the 182nd Airlift Wing in Peoria shares how deployments overseas completely changed his view of freedom, comfort and what it means to be “rich.” Growing up in a single‑parent home in America, he already knew struggle but seeing how people live in other countries made him realize how easily we take basic things for granted: clean running water, safety, opportunity, even the right to question our leaders.​\n\nIn this Idea Sandbox clip, he contrasts American privil...",
      "link": "https://www.youtube.com/watch?v=FVYRVLXTlGc",
      "publishedAt": "2025-12-07T20:54:26+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/FVYRVLXTlGc/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/FVYRVLXTlGc/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 25
    },
    {
      "id": "youtube-TraUlsInfU8",
      "videoId": "TraUlsInfU8",
      "title": "The Costly Blind Spot Most Business Owners Miss (CFO Explains)",
      "description": "After 30+ years as a CFO across multiple industries, Lowell Mora keeps seeing the same quiet disaster: business owners who ‘know’ their numbers but never analyze their product and customer margins deeply enough. On the surface, everything looks fine—revenue is coming in, top customers seem loyal—but hidden in the data are loss‑making products, underpriced contracts and entire segments that are slowly bleeding profit.”​​\n\nIn this Idea Sandbox clip, Lowell explains why experience alone creates bli...",
      "link": "https://www.youtube.com/watch?v=TraUlsInfU8",
      "publishedAt": "2025-12-06T20:46:31+00:00",
      "platform": "youtube",
      "thumbnail": "https://img.youtube.com/vi/TraUlsInfU8/maxresdefault.jpg",
      "thumbnailFallback": "https://img.youtube.com/vi/TraUlsInfU8/hqdefault.jpg",
      "author": "The Idea Sandbox",
      "views": 9
    }
  ],
  "lastUpdated": "2026-01-27T06:14:31.566Z",
  "fetchMethod": "rss_feed",
  "note": "Fetched from YouTube RSS feed - no API quota used"
}